public/shipping/fedex/wsdl/39 - Ground International Basic Rate Request.xml

<?xml version="1.0" encoding="UTF-8" ?> 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:q0="http://fedex.com/ws/rate/v6" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<q0:RateRequest>
<q0:WebAuthenticationDetail>
<q0:UserCredential>
<q0:Key>KEY</q0:Key> 
<q0:Password>PASSWORD</q0:Password> 
</q0:UserCredential>
</q0:WebAuthenticationDetail>
<q0:ClientDetail>
<q0:AccountNumber>123456789</q0:AccountNumber> 
<q0:MeterNumber>1234567</q0:MeterNumber> 
</q0:ClientDetail>
<q0:TransactionDetail>
<q0:CustomerTransactionId>Ground International Basic Rate</q0:CustomerTransactionId> 
</q0:TransactionDetail>
<q0:Version>
<q0:ServiceId>crs</q0:ServiceId> 
<q0:Major>6</q0:Major> 
<q0:Intermediate>0</q0:Intermediate> 
<q0:Minor>0</q0:Minor> 
</q0:Version>
<q0:RequestedShipment>
<q0:ShipTimestamp>2009-01-15T12:00:00-05:00</q0:ShipTimestamp> 
<q0:DropoffType>REGULAR_PICKUP</q0:DropoffType> 
<q0:ServiceType>FEDEX_GROUND</q0:ServiceType> 
<q0:PackagingType>YOUR_PACKAGING</q0:PackagingType> 
<q0:Shipper>
<q0:Address>
<q0:PostalCode>38017</q0:PostalCode> 
<q0:CountryCode>US</q0:CountryCode> 
</q0:Address>
</q0:Shipper>
<q0:Recipient>
<q0:Address>
<q0:PostalCode>M5V2T6</q0:PostalCode> 
<q0:CountryCode>CA</q0:CountryCode> 
<q0:Residential>true</q0:Residential> 
</q0:Address>
</q0:Recipient>
<q0:ShippingChargesPayment>
<q0:PaymentType>SENDER</q0:PaymentType> 
<q0:Payor>
<q0:AccountNumber>123456789</q0:AccountNumber> 
<q0:CountryCode>US</q0:CountryCode> 
</q0:Payor>
</q0:ShippingChargesPayment>
<q0:RateRequestTypes>ACCOUNT</q0:RateRequestTypes> 
<q0:PackageCount>1</q0:PackageCount> 
<q0:PackageDetail>INDIVIDUAL_PACKAGES</q0:PackageDetail> 
<q0:RequestedPackages>
<q0:SequenceNumber>1</q0:SequenceNumber> 
<q0:Weight>
<q0:Units>LB</q0:Units> 
<q0:Value>15.0</q0:Value> 
</q0:Weight>
<q0:Dimensions>
<q0:Length>10</q0:Length> 
<q0:Width>5</q0:Width> 
<q0:Height>5</q0:Height> 
<q0:Units>IN</q0:Units> 
</q0:Dimensions>
</q0:RequestedPackages>
</q0:RequestedShipment>
</q0:RateRequest>
</soapenv:Body>
</soapenv:Envelope>